---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData
source: html/4911068f-9f93-79d5-4f77-129185045e98.htm
---
# CodeCheckingParameterServiceData Properties

The current document.